# Anaconda、conda与生信

# 什么是Conda？
conda可以理解为一个工具，也是一个可执行命令，其核心功能是包管理与环境管理。包管理与pip的使用类似，环境管理则允许用户方便地安装不同版本的python并可以快速切换。

# 什么是Anaconda？
## Anaconda
**Anaconda**是conda的一个发行版，里面预装好了conda、某个版本的python、众多packages、**科学计算工具**等等，其实还有**Miniconda**，顾名思义，它只包含最基本的内容——python与conda。

## 虚拟环境
>**环境**：一个python环境中需要有一个**解释器**，和一个**包集合**
>**解释器**： 解释器根据python的版本大概分为2和3。python2和3之间无法互相兼容，也就是说用python2语法写出来的脚本不一定能在python3的解释器中运行
>**包集合**： 包集合中包含了自带的包和第三方包，第三方包我们一般通过pip或者easy_install来下载，当一个python环境中不包含这个包，那么引用了这个包的程序不能在该python环境中运行

对于我们常见的python来说，我们一个项目中需要包含多个包，我们在使用这些包的时候，需要先使用pip安装我们所需要的包，接下来在我们的项目中引入并使用我们的包。

> pip :是 Python 的包管理工具，用于安装、升级和卸载 Python 包。

那么假设我们同时进行多个项目，这些项目都依赖某个包，例如`numpy`这个包。除了`numpy`以外，它们各自有各自的依赖包，这就会有个问题，就是包的版本冲突问题。比方说A项目以来X包，X包需要1.01.15版本的`numpy`，B项目依赖Y包，Y包需要1.162.0版本的`numpy`。这时候我们就需要一个类似于“虚拟机”的东西，或者说叫做虚拟环境，我们可以创建多个虚拟环境，不同的虚拟环境相互隔离，互不干扰（有点类似于8848的双密码双空间😂）例如python的虚拟环境`virtualenv`。

>Anaconda是一个包含众多科学计算包的Python发行版，简化了Python环境的搭建和管理。conda作为包和环境管理器，允许用户方便地创建、切换和管理虚拟环境，解决Python版本冲突和包依赖问题。

>**总结**：python使用时，会遇到环境配置中包管理的问题，包括很麻烦的pip下载第三方包和不同项目间包混淆的两大难题；
>而**Anaconda**=python+很多常用的科学计算包+conda，其中自带的包解决了问题一，安装时只需`conda install XX`即可；
>而**conda**作为一个包管理器、环境管理器，能够给不同的项目创建相互隔离的虚拟环境以避免包的混淆，还能列出依赖包并自动安装其依赖项，并能便捷地在包的不同版本中自由切换，从而解决问题二。conda实现了：每个程序开发都选用不同的环境，而开发好之后又能将该程序需要的环境(第三方包)都独立打包出来。——Leviathan 2025.8.29

## 生信为什么要学Linux
1. 性能要求：生信要求长时间跑数据运行CPU，内存反复读写，对此Mac又贵又散热不好，windows差点意思，最优解是Linux服务器
2. 生物信息软件大部分（90%）是Linux版本：开源、免费
3. 命令行操作更为高效：点鼠标慢；命令行适合批量化和自动化的操作
